witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
IRAM2 static struct sysmenu_item_handler sysmenu_spectrum_handlers[] =
	{
		{"Spectrum START", SYSMENU_RUN, 0, SYSMENU_HANDL_SPECTRUM_Start},
		{"Begin, kHz", SYSMENU_UINT32, (uint32_t *)&TRX.SPEC_Begin, SYSMENU_HANDL_SPECTRUM_Begin},
		{"End, kHz", SYSMENU_UINT32, (uint32_t *)&TRX.SPEC_End, SYSMENU_HANDL_SPECTRUM_End},
		{"Top, dBm", SYSMENU_INT16, (uint32_t *)&TRX.SPEC_TopDBM, SYSMENU_HANDL_SPECTRUM_TopDBM},
		{"Bottom, dBm", SYSMENU_INT16, (uint32_t *)&TRX.SPEC_BottomDBM, SYSMENU_HANDL_SPECTRUM_BottomDBM},
};
static uint8_t sysmenu_spectrum_item_count = sizeof(sysmenu_spectrum_handlers) / sizeof(sysmenu_spectrum_handlers[0]);

IRAM2 static struct sysmenu_item_handler sysmenu_wspr_handlers[] =
	{
		{"WSPR Beacon START", SYSMENU_RUN, 0, SYSMENU_HANDL_WSPR_Start},
		{"Freq offset", SYSMENU_INT16, (uint32_t *)&TRX.WSPR_FREQ_OFFSET, SYSMENU_HANDL_WSPR_FREQ_OFFSET},
		{"BAND 160m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_160, SYSMENU_HANDL_WSPR_BAND160},
		{"BAND 80m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_80, SYSMENU_HANDL_WSPR_BAND80},
		{"BAND 40m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_40, SYSMENU_HANDL_WSPR_BAND40},
		{"BAND 30m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_30, SYSMENU_HANDL_WSPR_BAND30},
		{"BAND 20m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_20, SYSMENU_HANDL_WSPR_BAND20},
		{"BAND 17m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_17, SYSMENU_HANDL_WSPR_BAND17},
		{"BAND 15m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_15, SYSMENU_HANDL_WSPR_BAND15},
		{"BAND 12m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_12, SYSMENU_HANDL_WSPR_BAND12},
		{"BAND 10m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_10, SYSMENU_HANDL_WSPR_BAND10},
		{"BAND 6m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_6, SYSMENU_HANDL_WSPR_BAND6},
		{"BAND 2m", SYSMENU_BOOLEAN, (uint32_t *)&TRX.WSPR_BANDS_2, SYSMENU_HANDL_WSPR_BAND2},
};
static uint8_t sysmenu_wspr_item_count = sizeof(sysmenu_wspr_handlers) / sizeof(sysmenu_wspr_handlers[0]);

IRAM2 static struct sysmenu_item_handler sysmenu_services_handlers[] =
	{
		{"Band SWR", SYSMENU_RUN, 0, SYSMENU_HANDL_SWR_BAND_START},
		{"HF SWR", SYSMENU_RUN, 0, SYSMENU_HANDL_SWR_HF_START},
		{"Spectrum Analyzer", SYSMENU_MENU, 0, SYSMENU_HANDL_SPECTRUMMENU},
		{"RDA Statistics", SYSMENU_RUN, 0, SYSMENU_HANDL_RDA_STATS},
		{"Propagination", SYSMENU_RUN, 0, SYSMENU_HANDL_PROPAGINATION},
		{"WSPR Beacon", SYSMENU_MENU, 0, SYSMENU_HANDL_WSPRMENU},
		{"SWR Tandem Match Contr.", SYSMENU_RUN, 0, SYSMENU_HANDL_SWR_Tandem_Ctrl}, //Tisho
};
static uint8_t sysmenu_services_item_count = sizeof(sysmenu_services_handlers) / sizeof(sysmenu_services_handlers[0]);

//COMMON MENU
static void drawSystemMenuElement(char *title, SystemMenuType type, uint32_t *value, bool onlyVal);
static void SYSMENU_WIFI_DrawSelectAP1Menu(bool full_redraw);
static void SYSMENU_WIFI_SelectAP1MenuMove(int8_t dir);
static void SYSMENU_WIFI_DrawAP1passwordMenu(bool full_redraw);
static void SYSMENU_WIFI_RotatePasswordChar1(int8_t dir);
static void SYSMENU_WIFI_DrawSelectAP2Menu(bool full_redraw);
static void SYSMENU_WIFI_SelectAP2MenuMove(int8_t dir);
static void SYSMENU_WIFI_DrawAP2passwordMenu(bool full_redraw);
static void SYSMENU_WIFI_RotatePasswordChar2(int8_t dir);
static void SYSMENU_WIFI_DrawSelectAP3Menu(bool full_redraw);
static void SYSMENU_WIFI_SelectAP3MenuMove(int8_t dir);
static void SYSMENU_WIFI_DrawAP3passwordMenu(bool full_redraw);
static void SYSMENU_WIFI_RotatePasswordChar3(int8_t dir);
static void SYSMENU_TRX_DrawCallsignMenu(bool full_redraw);
static void SYSMENU_TRX_RotateCallsignChar(int8_t dir);
static void SYSMENU_TRX_DrawLocatorMenu(bool full_redraw);
static void SYSMENU_TRX_RotateLocatorChar(int8_t dir);

static struct sysmenu_item_handler *sysmenu_handlers_selected = &sysmenu_handlers[0];
static uint8_t *sysmenu_item_count_selected = &sysmenu_item_count;
static uint8_t systemMenuIndex = 0;
static uint8_t systemMenuRootIndex = 0;
static uint16_t sysmenu_y = 5;
static uint8_t sysmenu_i = 0;
static bool sysmenu_onroot = true;
bool SYSMENU_hiddenmenu_enabled = false;
static bool sysmenu_services_opened = false;
static bool sysmenu_infowindow_opened = false;
static bool sysmenu_sysinfo_opened = false;
static bool sysmenu_item_selected_by_enc2 = false;

//WIFI
static bool sysmenu_wifi_selectap1_menu_opened = false;
static bool sysmenu_wifi_selectap2_menu_opened = false;
static bool sysmenu_wifi_selectap3_menu_opened = false;
static bool sysmenu_wifi_setAP1password_menu_opened = false;
static bool sysmenu_wifi_setAP2password_menu_opened = false;
static bool sysmenu_wifi_setAP3password_menu_opened = false;
static bool sysmenu_trx_setCallsign_menu_opened = false;
static bool sysmenu_trx_setLocator_menu_opened = false;
static uint16_t sysmenu_wifi_rescan_interval = 0;
static uint8_t sysmenu_wifi_selected_ap_index = 0;
static uint8_t sysmenu_wifi_selected_ap_password_char_index = 0;
static uint8_t sysmenu_trx_selected_callsign_char_index = 0;
static uint8_t sysmenu_trx_selected_locator_char_index = 0;

//Time menu
static bool sysmenu_timeMenuOpened = false;
static uint8_t TimeMenuSelection = 0;

//TRX MENU

static void SYSMENU_HANDL_TRXMENU(int8_t direction)
{
	#pragma unused(direction)
	sysmenu_handlers_selected = &sysmenu_trx_handlers[0];
	sysmenu_item_count_selected = &sysmenu_trx_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

void SYSMENU_TRX_RFPOWER_HOTKEY(void)
{
	sysmenu_handlers_selected = &sysmenu_trx_handlers[0];
	sysmenu_item_count_selected = &sysmenu_trx_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_redraw(false);
}

void SYSMENU_TRX_STEP_HOTKEY(void)
{
	sysmenu_handlers_selected = &sysmenu_trx_handlers[0];
	sysmenu_item_count_selected = &sysmenu_trx_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 7;
	if (TRX.Fast)
		systemMenuIndex = 8;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_TRX_BandMap(int8_t direction)
{
	if (direction > 0)
		TRX.BandMapEnabled = true;
	if (direction < 0)
		TRX.BandMapEnabled = false;
}

static void SYSMENU_HANDL_TRX_AutoGain(int8_t direction)
{
	if (direction > 0)
		TRX.AutoGain = true;
	if (direction < 0)
		TRX.AutoGain = false;
	FPGA_NeedSendParams = true;
}

