witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
//FLASH MENU

static void SYSMENU_HANDL_Bootloader(int8_t direction)
{
	#pragma unused(direction)
	WM8731_CleanBuffer();
	TRX_NeedGoToBootloader = true;
	TRX_Inited = false;
	LCD_busy = true;
}

//SYSTEM INFO
static void SYSMENU_HANDL_SYSINFO(int8_t direction)
{
	sysmenu_infowindow_opened = true;
	sysmenu_sysinfo_opened = true;
	if(direction != 0)
		LCDDriver_Fill(BG_COLOR);
	#define y_offs 20
	uint16_t y = 10;
	char out[80];
	sprintf(out, "STM32 FW ver: %s", version_string);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "FPGA FW ver: %d.%d.%d", FPGA_FW_Version[2], FPGA_FW_Version[1], FPGA_FW_Version[0]);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "WIFI IP: %s", WIFI_IP);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "FPGA SAMPLES: %d     ", dbg_FPGA_samples);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "STM32 VOLTAGE: %f     ", TRX_STM32_VREF);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "IQ PHASE: %f     ", TRX_IQ_phase_error);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "ADC MIN/MAX: %d/%d     ", TRX_ADC_MINAMPLITUDE, TRX_ADC_MAXAMPLITUDE);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	sprintf(out, "VCXO ERROR: %d     ", TRX_VCXO_ERROR);
	LCDDriver_printText(out, 5, y, FG_COLOR, BG_COLOR, 2);
	y += y_offs;
	
	LCD_UpdateQuery.SystemMenu = true;
}

//CALIBRATION MENU

static void SYSMENU_HANDL_CALIB_ENCODER_INVERT(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_INVERT = true;
	if (direction < 0)
		CALIBRATE.ENCODER_INVERT = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER2_INVERT(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER2_INVERT = true;
	if (direction < 0)
		CALIBRATE.ENCODER2_INVERT = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_DEBOUNCE(int8_t direction)
{
	if (CALIBRATE.ENCODER_DEBOUNCE > 0 || direction > 0)
		CALIBRATE.ENCODER_DEBOUNCE += direction;
	if (CALIBRATE.ENCODER_DEBOUNCE > 250)
		CALIBRATE.ENCODER_DEBOUNCE = 250;
}

static void SYSMENU_HANDL_CALIB_ENCODER2_DEBOUNCE(int8_t direction)
{
	if (CALIBRATE.ENCODER2_DEBOUNCE > 0 || direction > 0)
		CALIBRATE.ENCODER2_DEBOUNCE += direction;
	if (CALIBRATE.ENCODER2_DEBOUNCE > 250)
		CALIBRATE.ENCODER2_DEBOUNCE = 250;
}

static void SYSMENU_HANDL_CALIB_ENCODER_SLOW_RATE(int8_t direction)
{
	CALIBRATE.ENCODER_SLOW_RATE += direction;
	if (CALIBRATE.ENCODER_SLOW_RATE < 1)
		CALIBRATE.ENCODER_SLOW_RATE = 1;
	if (CALIBRATE.ENCODER_SLOW_RATE > 100)
		CALIBRATE.ENCODER_SLOW_RATE = 100;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ON_FALLING(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_ON_FALLING = true;
	if (direction < 0)
		CALIBRATE.ENCODER_ON_FALLING = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ACCELERATION(int8_t direction)
{
	CALIBRATE.ENCODER_ACCELERATION += direction;
	if (CALIBRATE.ENCODER_ACCELERATION < 1)
		CALIBRATE.ENCODER_ACCELERATION = 1;
	if (CALIBRATE.ENCODER_ACCELERATION > 250)
		CALIBRATE.ENCODER_ACCELERATION = 250;
}

static void SYSMENU_HANDL_CALIBRATIONMENU(int8_t direction)
{
	#pragma unused(direction)
	if (!SYSMENU_hiddenmenu_enabled)
		return;
	sysmenu_handlers_selected = &sysmenu_calibration_handlers[0];
	sysmenu_item_count_selected = &sysmenu_calibration_item_count;
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SWR_Tandem_Ctrl(int8_t direction) //Tisho
{
	#pragma unused(direction)
	if (SYSMENU_TDM_CTRL_opened)
	{
	}
	else
	{
		SYSMENU_TDM_CTRL_opened = true;
		TDM_Voltages_Start();
		//		drawSystemMenu(true);
	}
}

static void SYSMENU_HANDL_CALIB_CICCOMP_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_val += direction;
	if (CALIBRATE.CICFIR_GAINER_val < 32)
		CALIBRATE.CICFIR_GAINER_val = 32;
	if (CALIBRATE.CICFIR_GAINER_val > 57)
		CALIBRATE.CICFIR_GAINER_val = 57;
}

static void SYSMENU_HANDL_CALIB_TXCICCOMP_SHIFT(int8_t direction)
{
	CALIBRATE.TXCICFIR_GAINER_val += direction;
	if (CALIBRATE.TXCICFIR_GAINER_val < 16)
		CALIBRATE.TXCICFIR_GAINER_val = 16;
	if (CALIBRATE.TXCICFIR_GAINER_val > 48)
		CALIBRATE.TXCICFIR_GAINER_val = 48;
}

static void SYSMENU_HANDL_CALIB_DAC_SHIFT(int8_t direction)
{
	CALIBRATE.DAC_GAINER_val += direction;
	if (CALIBRATE.DAC_GAINER_val < 14)
		CALIBRATE.DAC_GAINER_val = 14;
	if (CALIBRATE.DAC_GAINER_val > 28)
		CALIBRATE.DAC_GAINER_val = 28;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_LF(int8_t direction)
{
	if (CALIBRATE.rf_out_power_up2mhz > 0)
		CALIBRATE.rf_out_power_up2mhz += direction;
	if (CALIBRATE.rf_out_power_up2mhz == 0 && direction > 0)
		CALIBRATE.rf_out_power_up2mhz += direction;
	if (CALIBRATE.rf_out_power_up2mhz > 100)
		CALIBRATE.rf_out_power_up2mhz = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_HF_LOW(int8_t direction)
{
	if (CALIBRATE.rf_out_power_up5mhz > 0)
		CALIBRATE.rf_out_power_up5mhz += direction;
	if (CALIBRATE.rf_out_power_up5mhz == 0 && direction > 0)
		CALIBRATE.rf_out_power_up5mhz += direction;
	if (CALIBRATE.rf_out_power_up5mhz > 100)
		CALIBRATE.rf_out_power_up5mhz = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_HF1(int8_t direction)
{
	if (CALIBRATE.rf_out_power_up15mhz > 0)
		CALIBRATE.rf_out_power_up15mhz += direction;
	if (CALIBRATE.rf_out_power_up15mhz == 0 && direction > 0)
		CALIBRATE.rf_out_power_up15mhz += direction;
	if (CALIBRATE.rf_out_power_up15mhz > 100)
		CALIBRATE.rf_out_power_up15mhz = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_HF2(int8_t direction)
{
	if (CALIBRATE.rf_out_power_up30mhz > 0)
		CALIBRATE.rf_out_power_up30mhz += direction;
	if (CALIBRATE.rf_out_power_up30mhz == 0 && direction > 0)
		CALIBRATE.rf_out_power_up30mhz += direction;
	if (CALIBRATE.rf_out_power_up30mhz > 100)
		CALIBRATE.rf_out_power_up30mhz = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO()->Freq);
}

